Tekla Open API Reference for Tekla Structures 2025
FormBorders Class
 The FormBorders class handles the storing and restoring of the form size and location.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Dialog.FormBorders
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static class FormBorders
Public NotInheritable Class FormBorders
The FormBorders type exposes the following members.
Methods
Name | Description
CheckScreenPosition(Form)
 Moves form to primary screen.
CheckScreenPosition(Window)
 Moves window to primary screen.
IsOnActiveDisplays
 Checks form quadrants to be sure full extents is on a single screen
RestoreFormSizeAndLocation(Form)
 Restores the form size and location from the registry.
RestoreFormSizeAndLocation(Window)
 Restores the WPF window size and location from the registry.
StoreFormSizeAndLocation(Form)
 Stores the form size and location into the registry.
StoreFormSizeAndLocation(Window)
 Stores the window size and location into the registry.
Top
See Also
Reference
Tekla.Structures.Dialog Namespace